/* errAuthorizationInvalidSet */
"-60001" = "Valtuutusoikeudet ovat virheelliset.";

/* errAuthorizationInvalidRef */
"-60002" = "Valtuutusviite on virheellinen.";

/* errAuthorizationInvalidTag */
"-60003" = "Valtuutustagi on virheellinen.";

/* errAuthorizationInvalidPointer */
"-60004" = "Palautettu valtuutus on virheellinen.";

/* errAuthorizationDenied */
"-60005" = "Valtuutus evättiin.";

/* errAuthorizationCanceled */
"-60006" = "Käyttäjä kumosi valtuutuksen.";

/* errAuthorizationInteractionNotAllowed */
"-60007" = "Valtuutus evättiin, koska käyttäjän toiminta ei ole mahdollista.";

/* errAuthorizationInternal */
"-60008" = "Toiminnolle ei saatu valtuutusta.";

/* errAuthorizationExternalizeNotAllowed */
"-60009" = "Valtuutusta ei voida muuntaa ulkoiseen muotoon.";

/* errAuthorizationInternalizeNotAllowed */
"-60010" = "Valtuutusta ei voida luoda ulkoisesta muodosta.";

/* errAuthorizationInvalidFlags */
"-60011" = "Annetut valintaliput ovat virheellisiä tälle valtuutustoiminnolle.";

/* errAuthorizationToolExecuteFailure */
"-60031" = "Määriteltyä ohjelmaa ei voitu suorittaa.";

/* errAuthorizationToolEnvironmentError */
"-60032" = "Suoritettaessa etuoikeutettua työkalua palautettiin virheellinen tila.";

/* errAuthorizationBadAddress */
"-60033" = "Pyydetty socket-osoite on virheellinen (oltava 0-1023).";

/* errSSLProtocol */
"-9800" = "SSL-protokollavirhe";

/* errSSLNegotiation */
"-9801" = "Salausalgoritmin neuvottelu epäonnistui";

/* errSSLFatalAlert */
"-9802" = "Vakava virhe";

/* errSSLWouldBlock */
"-9803" = "I/O tukkeutuu (ei vakava)";

/* errSSLSessionNotFound */
"-9804" = "yritys palauttaa tuntematon istunto";

/* errSSLClosedGraceful */
"-9805" = "yhteys katkesi oikein";

/* errSSLClosedAbort */
"-9806" = "yhteys katkesi virheeseen";

/* errSSLXCertChainInvalid */
"-9807" = "virheellinen varmenneketju";

/* errSSLBadCert */
"-9808" = "virheellinen varmennemuoto";

/* errSSLCrypto */
"-9809" = "piilevä salausvirhe";

/* errSSLInternal */
"-9810" = "Sisäinen virhe";

/* errSSLModuleAttach */
"-9811" = "moduulin liittäminen epäonnistui";

/* errSSLUnknownRootCert */
"-9812" = "kelvollinen varmenneketju, epäluotettava juuri";

/* errSSLNoRootCert */
"-9813" = "varmenneketju ei juuren todentama";

/* errSSLCertExpired */
"-9814" = "ketjussa vanhentunut varmenne";

/* errSSLCertNotYetValid */
"-9815" = "ketjun varmenne ei ole vielä kelvollinen";

/* errSSLClosedNoNotify */
"-9816" = "palvelin sulki istunnon ilman ilmoitusta";

/* errSSLBufferOverflow */
"-9817" = "annettiin riittämätön puskuri";

/* errSSLBadCipherSuite */
"-9818" = "virheellinen SSLCipherSuite";

/* errSSLPeerUnexpectedMsg */
"-9819" = "vastaanotettiin odottamaton viesti";

/* errSSLPeerBadRecordMac */
"-9820" = "virheellinen MAC";

/* errSSLPeerDecryptionFail */
"-9821" = "salauksen purku epäonnistui";

/* errSSLPeerRecordOverflow */
"-9822" = "tietueen ylivuoto";

/* errSSLPeerDecompressFail */
"-9823" = "pakkauksen purku epäonnistui";

/* errSSLPeerHandshakeFail */
"-9824" = "kättely epäonnistui";

/* errSSLPeerBadCert */
"-9825" = "sekalainen virheellinen varmenne";

/* errSSLPeerUnsupportedCert */
"-9826" = "virheellinen ei-tuettu varmennemuoto";

/* errSSLPeerCertRevoked */
"-9827" = "varmenne peruttu";

/* errSSLPeerCertExpired */
"-9828" = "varmenne vanhentunut";

/* errSSLPeerCertUnknown */
"-9829" = "tuntematon varmenne";

/* errSSLIllegalParam */
"-9830" = "luvaton parametri";

/* errSSLPeerUnknownCA */
"-9831" = "tuntematon varmentaja";

/* errSSLPeerAccessDenied */
"-9832" = "pääsy evätty";

/* errSSLPeerDecodeError */
"-9833" = "purkuvirhe";

/* errSSLPeerDecryptError */
"-9834" = "salausvirhe";

/* errSSLPeerExportRestriction */
"-9835" = "vientirajoitus";

/* errSSLPeerProtocolVersion */
"-9836" = "virheellinen protokollaversio";

/* errSSLPeerInsufficientSecurity */
"-9837" = "riittämätön suojaus";

/* errSSLPeerInternalError */
"-9838" = "sisäinen virhe";

/* errSSLPeerUserCancelled */
"-9839" = "käyttäjä perui";

/* errSSLPeerNoRenegotiation */
"-9840" = "uudelleenneuvottelua ei sallita";

/* errSSLServerAuthCompleted */
"-9841" = "palvelinvarmenne on käytössä tai sitä ei huomioitu, jos tarkistaminen ei ole käytössä";

/* errSSLClientCertRequested */
"-9842" = "palvelin on pyytänyt asiakasvarmennetta";

/* errSSLHostNameMismatch */
"-9843" = "vertaispalvelimen nimi ei vastaa";

/* errSSLConnectionRefused */
"-9844" = "kumppani katkaisi yhteyden vastaamatta";

/* errSSLDecryptionFail */
"-9845" = "salauksen purku epäonnistui";

/* errSSLBadRecordMac */
"-9846" = "virheellinen MAC";

/* errSSLRecordOverflow */
"-9847" = "tietueen ylivuoto";

/* errSSLBadConfiguration */
"-9848" = "määrittelyvirhe";

/* errSecSuccess */
"0" = "Ei virhettä.";

/* errSecUnimplemented */
"-4" = "Funktiota tai toimintoa ei toteutettu.";

/* errSecParam */
"-50" = "Toiminnolle annettiin yksi tai useampi virheellinen parametri.";

/* errSecAllocate */
"-108" = "Muistinvaraus epäonnistui.";

/* errSecNotAvailable */
"-25291" = "Avainnippua ei ole käytettävissä. Tietokone on ehkä käynnistettävä uudelleen.";

/* errSecReadOnly */
"-25292" = "Avainnippua ei voida muuttaa.";

/* errSecAuthFailed */
"-25293" = "Käyttäjätunnus tai salauslause on väärin.";

/* errSecNoSuchKeychain */
"-25294" = "Määriteltyä avainnippua ei löytynyt.";

/* errSecInvalidKeychain */
"-25295" = "Määritelty avainnippu ei ole kelvollinen avainnipputiedosto.";

/* errSecDuplicateKeychain */
"-25296" = "Samanniminen avainnippu on jo olemassa.";

/* errSecDuplicateCallback */
"-25297" = "Määritelty callback-funktio on jo asennettu.";

/* errSecInvalidCallback */
"-25298" = "Määritelty callback-funktio on virheellinen.";

/* errSecDuplicateItem */
"-25299" = "Määritelty kohde on jo avainnipussa.";

/* errSecItemNotFound */
"-25300" = "Määriteltyä kohdetta ei löytynyt avainnipusta.";

/* errSecBufferTooSmall */
"-25301" = "Määritellyn kohteen käyttämiseen ei ole tarpeeksi muistia.";

/* errSecDataTooLarge */
"-25302" = "Kohde sisältää tietoa, joka on liian suurta tai muodossa, jota ei voida esittää.";

/* errSecNoSuchAttr */
"-25303" = "Määriteltyä määrettä ei ole olemassa.";

/* errSecInvalidItemRef */
"-25304" = "Määritelty kohde ei enää kelpaa. Se on saatettu poistaa avainnipusta.";

/* errSecInvalidSearchRef */
"-25305" = "Nykyisestä avainnipusta ei voida etsiä.";

/* errSecNoSuchClass */
"-25306" = "Määritelty kohde ei tunnu olevan kelvollinen avainnipun kohde.";

/* errSecNoDefaultKeychain */
"-25307" = "Oletusavainnippua ei löytynyt.";

/* errSecInteractionNotAllowed */
"-25308" = "Käyttäjän toimintaa ei sallita.";

/* errSecReadOnlyAttr */
"-25309" = "Määriteltyä määrettä ei voida muuttaa.";

/* errSecWrongSecVersion */
"-25310" = "Avainnippu on luotu käyttöjärjestelmän eri versiolla eikä sitä voida avata.";

/* errSecKeySizeNotAllowed */
"-25311" = "Kohde määrittelee avaimen koon, joka on liian suuri.";

/* errSecNoStorageModule */
"-25312" = "Tarvittavaa komponenttia (tiedontallennusmoduuli) ei voitu ladata. Tietokone on ehkä käynnistettävä uudelleen.";

/* errSecNoCertificateModule */
"-25313" = "Tarvittavaa komponenttia (varmennemoduuli) ei voitu ladata. Tietokone on ehkä käynnistettävä uudelleen.";

/* errSecNoPolicyModule */
"-25314" = "Tarvittavaa komponenttia (menettelymoduuli) ei voitu ladata. Tietokone on ehkä käynnistettävä uudelleen.";

/* errSecInteractionRequired */
"-25315" = "Käyttäjän toimintaa tarvitaan, mutta se ei ole tällä hetkellä sallittua.";

/* errSecDataNotAvailable */
"-25316" = "Kohteen sisältöä ei voida noutaa.";

/* errSecDataNotModifiable */
"-25317" = "Kohteen sisältöä ei voida muuttaa.";

/* errSecCreateChainFailed */
"-25318" = "Yhtä tai useampaa tämän varmenteen kelpuuttamiseen tarvittavaa varmennetta ei löytynyt.";

/* errSecInvalidPrefsDomain */
"-25319" = "Määritelty asetusdomain on virheellinen.";

/* errSecACLNotSimple */
"-25240" = "Määritelty pääsynhallintaluettelo ei ole normaalissa (yksinkertaisessa) muodossa.";

/* errSecPolicyNotFound */
"-25241" = "Määriteltyä menettelyä ei löytynyt.";

/* errSecInvalidTrustSetting */
"-25242" = "Määritelty luottamusasetus on virheellinen.";

/* errSecNoAccessForItem */
"-25243" = "Määritellyllä kohteella ei ole pääsynhallintaa.";

/* errSecInvalidOwnerEdit */
"-25244" = "Virheellinen yritys muuttaa kohteen omistajaa.";

/* errSecTrustNotAvailable */
"-25245" = "Luottamustuloksia ei saatavilla.";

/* errSecUnsupportedFormat */
"-25256" = "Tuonti/vientimuoto ei tuettu.";

/* errSecUnknownFormat */
"-25257" = "Tuntematon muoto tuonnissa.";

/* errSecKeyIsSensitive */
"-25258" = "Avainmateriaali pitää paketoida vientiä varten.";

/* errSecMultiplePrivKeys */
"-25259" = "Yritettiin tuoda useita yksityisiä avaimia.";

/* errSecPassphraseRequired */
"-25260" = "Tuontiin/vientiin tarvitaan salauslause.";

/* errSecInvalidPasswordRef */
"-25261" = "Salasanaviite oli virheellinen.";

/* errSecInvalidTrustSettings */
"-25262" = "Luottoasetustietue oli vioittunut.";

/* errSecNoTrustSettings */
"-25263" = "Luottoasetusta ei löytynyt.";

/* errSecPkcs12VerifyFailure */
"-25264" = "MAC-varmennus epäonnistui PKCS12-tuonnin aikana.";

/* errSecDecode */
"-26275" = "Annettua dataa ei voida purkaa.";

/* CSSMERR_CSP_INVALID_DATA_COUNT */
"-2147415768" = "CSP:n vektori puskurien virhearvoja.";

/* CSSMERR_CSP_INVALID_CONTEXT */
"-2147415760" = "CSP:n salauskontekstin virhearvot.";

/* CSSMERR_CSP_STAGED_OPERATION_IN_PROGRESS */
"-2147415736" = "CSP:n vaiheittaisen salaus-API:n virhearvot.";

/* CSSMERR_CSP_APPLE_PUBLIC_KEY_INCOMPLETE */
"-2147415039" = "* Yritettiin käyttää julkista avainta, joka on epätäydellinen * algoritmikohtaisten parametrien puutteen vuoksi.";

/* CSSMERR_CSP_APPLE_SIGNATURE_MISMATCH */
"-2147415038" = "koodiallekirjoitus ei sama";

/* CSSMERR_CSP_APPLE_INVALID_KEY_START_DATE */
"-2147415037" = "Avaimen StartDate/EndDate virheellinen";

/* CSSMERR_CSPDL_APPLE_DL_CONVERSION_ERROR */
"-2147415035" = "Avainnipun synkronoinnin virhekoodit";

/* CSSMERR_CSP_APPLE_SSLv2_ROLLBACK */
"-2147415034" = "SSLv2-täytetarkistus: rollback-hyökkäys havaittu";

/* CSSMERR_APPLEDL_INVALID_OPEN_PARAMETERS */
"-2147412992" = "CSSM_DL_DbCreate- tai CSSM_DL_DbOpen-funktioille annettu OpenParameters-argumentti ei ollut NULL eikä osoitin kelvolliseen CSSM_APPLEDL_OPEN_PARAMETERS-tietueeseen.";

/* CSSMERR_APPLEDL_DISK_FULL */
"-2147412991" = "toiminto epäonnistui, koska levy on täynnä";

/* CSSMERR_APPLEDL_QUOTA_EXCEEDED */
"-2147412990" = "toiminto epäonnistui, koska levykiintiö ylitettiin";

/* CSSMERR_APPLEDL_FILE_TOO_BIG */
"-2147412989" = "toiminto epäonnistui, koska tiedosto on liian suuri";

/* CSSMERR_APPLEDL_INVALID_DATABASE_BLOB */
"-2147412988" = "avainnipputietokannan sisäinen tieto (”blob”) on virheellinen";

/* CSSMERR_APPLEDL_INCOMPATIBLE_DATABASE_BLOB */
"-2147412986" = "sisäisen datamuodon versio tietokannan sisäiselle tiedolle (”blob”) on virheellinen";

/* CSSMERR_APPLETP_HOSTNAME_MISMATCH */
"-2147408896" = "Palvelinnimi ei sama";

/* CSSMERR_APPLETP_UNKNOWN_CRITICAL_EXTEN */
"-2147408895" = "Laajennusta, jonka Critical-lippu on asetettu, ei ymmärretty";

/* CSSMERR_APPLETP_NO_BASIC_CONSTRAINTS */
"-2147408894" = "Käytäntö vaatii perusrajoituksen laajennusta, mutta sitä ei ole";

/* CSSMERR_APPLETP_INVALID_CA */
"-2147408893" = "Virheellinen BasicConstraints.CA";

/* CSSMERR_APPLETP_INVALID_AUTHORITY_ID */
"-2147408892" = "Virheellinen varmentajan avaintunnus";

/* CSSMERR_APPLETP_INVALID_SUBJECT_ID */
"-2147408891" = "Virheellinen aiheen avaintunnus";

/* CSSMERR_APPLETP_INVALID_KEY_USAGE */
"-2147408890" = "Virheellinen avaimen käyttö käytännölle";

/* CSSMERR_APPLETP_INVALID_EXTENDED_KEY_USAGE */
"-2147408889" = "Virheellinen laajennetun avaimen käyttö käytännölle";

/* CSSMERR_APPLETP_INVALID_ID_LINKAGE */
"-2147408888" = "Virheellinen aiheen/varmentajan avaintunnusten linkitys";

/* CSSMERR_APPLETP_PATH_LEN_CONSTRAINT */
"-2147408887" = "PathLengthConstraint ylittyi";

/* CSSMERR_APPLETP_INVALID_ROOT */
"-2147408886" = "Varmenneryhmä päättyi juurivarmenteeseen, joka ei varmenna itseään";

/* CSSMERR_APPLETP_CRL_EXPIRED */
"-2147408885" = "CRL vanhentunut/ei vielä voimassa";

/* CSSMERR_APPLETP_CRL_NOT_FOUND */
"-2147408883" = "Sopivaa CRL:ää ei löydy";

/* CSSMERR_APPLETP_CRL_SERVER_DOWN */
"-2147408882" = "määritelty CRL-palvelin ei ole käytettävissä";

/* CSSMERR_APPLETP_CRL_BAD_URI */
"-2147408881" = "laiton CRL-jakopisteen osoite";

/* CSSMERR_APPLETP_UNKNOWN_CERT_EXTEN */
"-2147408880" = "Tuntematon kriittinen varmenne/CRL-laajennus";

/* CSSMERR_APPLETP_CRL_NOT_TRUSTED */
"-2147408878" = "CRL ei ole varmennettavissa ankkuriin tai juureen";

/* CSSMERR_APPLETP_CRL_INVALID_ANCHOR_CERT */
"-2147408877" = "CRL:n on varmistanut ei-luotettu juuri";

/* CSSMERR_APPLETP_CRL_POLICY_FAIL */
"-2147408876" = "CRL ei läpäissyt käytännön tarkistusta";

/* CSSMERR_APPLETP_IDP_FAIL */
"-2147408875" = "IssuingDistributionPoint-laajennusrikkomus";

/* CSSMERR_APPLETP_CERT_NOT_FOUND_FROM_ISSUER */
"-2147408874" = "Varmennetta ei löytynyt määritellystä issuerAltNamesta";

/* CSSMERR_APPLETP_BAD_CERT_FROM_ISSUER */
"-2147408873" = "Virheellinen varmenne määritellystä issuerAltNamesta";

/* CSSMERR_APPLETP_SMIME_EMAIL_ADDRS_NOT_FOUND */
"-2147408872" = "S/MIME-sähköpostiosoite ei sama";

/* CSSMERR_APPLETP_SMIME_BAD_EXT_KEY_USE */
"-2147408871" = "Sopivaa S/MIME ExtendedKeyUsagea ei löytynyt";

/* CSSMERR_APPLETP_SMIME_BAD_KEY_USE */
"-2147408870" = "S/MIME KeyUsage epäyhteensopiva";

/* CSSMERR_APPLETP_SMIME_KEYUSAGE_NOT_CRITICAL */
"-2147408869" = "S/MIME, varmenne jonka KeyUsage-merkintä on !critical";

/* CSSMERR_APPLETP_SMIME_NO_EMAIL_ADDRS */
"-2147408868" = "S/MIME, lehti jossa tyhjä aihenimi eikä sähköpostiosoitetta * SubjectAltNamessa";

/* CSSMERR_APPLETP_SMIME_SUBJ_ALT_NAME_NOT_CRIT */
"-2147408867" = "S/MIME, lehti jossa tyhjä aihenimi, SubjectAltName * ei kriittinen";

/* CSSMERR_APPLETP_SSL_BAD_EXT_KEY_USE */
"-2147408866" = "Sopivaa SSL ExtendedKeyUsagea ei löytynyt";

/* CSSMERR_APPLETP_OCSP_BAD_RESPONSE */
"-2147408865" = "jäsentymätön OCSP-vastaus";

/* CSSMERR_APPLETP_OCSP_BAD_REQUEST */
"-2147408864" = "jäsentymätön OCSP-pyyntö";

/* CSSMERR_APPLETP_OCSP_UNAVAILABLE */
"-2147408863" = "OCSP-palvelu ei käytettävissä";

/* CSSMERR_APPLETP_OCSP_STATUS_UNRECOGNIZED */
"-2147408862" = "OCSP-tila: varmenne tuntematon";

/* CSSMERR_APPLETP_INCOMPLETE_REVOCATION_CHECK */
"-2147408861" = "kumoustarkistus ei onnistunut jokaiselle varmenteelle";

/* CSSMERR_APPLETP_NETWORK_FAILURE */
"-2147408860" = "yleinen verkkovirhe";

/* CSSMERR_APPLETP_OCSP_NOT_TRUSTED */
"-2147408859" = "OCSP-vastausta ei voida varmistaa ankkuriin tai juureen";

/* CSSMERR_APPLETP_OCSP_INVALID_ANCHOR_CERT */
"-2147408858" = "OCSP-vastaus varmistettu ei-luotettuun juureen";

/* CSSMERR_APPLETP_OCSP_SIG_ERROR */
"-2147408857" = "OCSP-vastauksen allekirjoitusvirhe";

/* CSSMERR_APPLETP_OCSP_NO_SIGNER */
"-2147408856" = "OCSP-vastaukselle ei löytynyt allekirjoittajaa";

/* CSSMERR_APPLETP_OCSP_RESP_MALFORMED_REQ */
"-2147408855" = "OCSP-vastaajan tila: epämuodostunut pyyntö";

/* CSSMERR_APPLETP_OCSP_RESP_INTERNAL_ERR */
"-2147408854" = "OCSP-vastaajan tila: sisäinen virhe";

/* CSSMERR_APPLETP_OCSP_RESP_TRY_LATER */
"-2147408853" = "OCSP-vastaajan tila: yritä myöhemmin";

/* CSSMERR_APPLETP_OCSP_RESP_SIG_REQUIRED */
"-2147408852" = "OCSP-vastaajan tila: allekirjoitus vaaditaan";

/* CSSMERR_APPLETP_OCSP_RESP_UNAUTHORIZED */
"-2147408851" = "OCSP-vastaajan tila: valtuuttamaton";

/* CSSMERR_APPLETP_OCSP_NONCE_MISMATCH */
"-2147408850" = "OCSP-vastauksen nonce-luku ei vastannut pyyntöä";

/* CSSMERR_APPLETP_CS_BAD_CERT_CHAIN_LENGTH */
"-2147408849" = "laiton varmenneketjun pituus koodin allekirjoitukseen";

/* CSSMERR_APPLETP_CS_NO_BASIC_CONSTRAINTS */
"-2147408848" = "Puuttuvat perusrajoitukset koodin allekirjoitukseen";

/* CSSMERR_APPLETP_CS_BAD_PATH_LENGTH */
"-2147408847" = "Virheellinen PathLengthConstraint koodin allekirjoitukseen";

/* CSSMERR_APPLETP_CS_NO_EXTENDED_KEY_USAGE */
"-2147408846" = "Puuttuva ExtendedKeyUsage koodin allekirjoitukseen";

/* CSSMERR_APPLETP_CODE_SIGN_DEVELOPMENT */
"-2147408845" = "Kehitystyylinen koodin allekirjoitusvarmenne havaittu";

/* CSSMERR_APPLETP_RS_BAD_CERT_CHAIN_LENGTH */
"-2147408844" = "laiton varmenneketjun pituus resurssien allekirjoitukseen";

/* CSSMERR_APPLETP_RS_BAD_EXTENDED_KEY_USAGE */
"-2147408843" = "virheellinen laajennetun avaimen käyttö resurssien allekirjoitukseen";

/* CSSMERR_APPLETP_TRUST_SETTING_DENY */
"-2147408842" = "Luottoasetus: hylkää";

/* CSSMERR_APPLETP_INVALID_EMPTY_SUBJECT */
"-2147408841" = "virheellinen tyhjä SubjectName";

/* CSSMERR_APPLETP_UNKNOWN_QUAL_CERT_STATEMENT */
"-2147408840" = "tuntematon kriittinen Qualified Cert Statement ID";

/* CSSMERR_APPLE_DOTMAC_REQ_QUEUED */
"-2147408796" = "varmennepyyntö jonossa";

/* CSSMERR_APPLE_DOTMAC_REQ_REDIRECT */
"-2147408795" = "varmennepyyntö uudelleenohjattu";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_ERR */
"-2147408794" = "yleinen palvelimen ilmoittama virhe";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_PARAM */
"-2147408793" = "palvelimen ilmoittama parametrivirhe";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_AUTH */
"-2147408792" = "palvelimen ilmoittama valtuutusvirhe";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_UNIMPL */
"-2147408791" = "palvelimen ilmoittama ei ole toteutettu";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_NOT_AVAIL */
"-2147408790" = "palvelimen ilmoittama ei ole käytettävissä";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_ALREADY_EXIST */
"-2147408789" = "palvelimen ilmoittama on jo olemassa";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_SERVICE_ERROR */
"-2147408788" = "palvelimen ilmoittama palveluvirhe";

/* CSSMERR_APPLE_DOTMAC_REQ_IS_PENDING */
"-2147408787" = "määritellylle käyttäjälle on jo odottava pyyntö";

/* CSSMERR_APPLE_DOTMAC_NO_REQ_PENDING */
"-2147408786" = "ei odottavia pyyntöjä määritellylle käyttäjälle";

/* CSSMERR_APPLE_DOTMAC_CSR_VERIFY_FAIL */
"-2147408785" = "CSR:n varmistaminen epäonnistui";

/* CSSMERR_APPLE_DOTMAC_FAILED_CONSISTENCY_CHECK */
"-2147408784" = "palvelin raportoi yhdenmukaisuustarkistuksen epäonnistumisesta";

/* errSecCSUnimplemented */
"-67072" = "toteuttamaton koodiallekirjoitusominaisuus";

/* errSecCSInvalidObjectRef */
"-67071" = "virheellinen API-objektiviite";

/* errSecCSInvalidFlags */
"-67070" = "määriteltiin virheellisiä tai sopimattomia API-lippuja";

/* errSecCSObjectRequired */
"-67069" = "vaadittu osoitinargumentti oli NULL";

/* errSecCSStaticCodeNotFound */
"-67068" = "koodiobjektia ei löydy levyltä";

/* errSecCSUnsupportedGuestAttributes */
"-67067" = "vieraita ei löydy tätä attribuuttijoukkoa käyttäen";

/* errSecCSInvalidAttributeValues */
"-67066" = "annetut attribuuttiarvot ovat virheellisiä";

/* errSecCSNoSuchCode */
"-67065" = "palvelimella ei ole vierasta, jolla on pyydetyt attribuutit";

/* errSecCSMultipleGuests */
"-67064" = "palvelimella on useita vieraita, joilla on tämä attribuuttiarvo";

/* errSecCSGuestInvalid */
"-67063" = "koodihenkilöllisyys on mitätöity";

/* errSecCSUnsigned */
"-67062" = "koodiobjektia ei ole allekirjoitettu";

/* errSecCSSignatureFailed */
"-67061" = "koodia tai allekirjoitusta muutettu";

/* errSecCSSignatureNotVerifiable */
"-67060" = "allekirjoitusta ei voida lukea johtuen esimerkiksi tiedostojärjestelmästä, joka kuvaa juuren etuoikeudettomaan käyttäjään";

/* errSecCSSignatureUnsupported */
"-67059" = "allekirjoituksen tyyppiä tai versiota ei tueta";

/* errSecCSBadDictionaryFormat */
"-67058" = "vaadittu plist-tiedosto tai resurssi on epämuodostunut";

/* errSecCSResourcesNotSealed */
"-67057" = "resursseja ei ole sinetöity allekirjoituksella";

/* errSecCSResourcesNotFound */
"-67056" = "sinetöityä resurssia ei löydy koodista";

/* errSecCSResourcesInvalid */
"-67055" = "sinetöity resurssihakemisto on virheellinen";

/* errSecCSBadResource */
"-67054" = "sinetöity resurssi puuttuu tai on virheellinen";

/* errSecCSResourceRulesInvalid */
"-67053" = "resurssinvalintasäännöt virheellisiä";

/* errSecCSReqInvalid */
"-67052" = "koodivaatimukset virheellisiä tai vioittuneita";

/* errSecCSReqUnsupported */
"-67051" = "koodivaatimusten versiota tai tyyppiä ei tueta";

/* errSecCSReqFailed */
"-67050" = "ei täyttänyt koodivaatimuksia";

/* errSecCSBadObjectFormat */
"-67049" = "objektitiedostomuoto virheellinen tai epäsopiva";

/* errSecCSInternalError */
"-67048" = "sisäinen virhe koodin allekirjoitusalijärjestelmässä";

/* errSecCSHostReject */
"-67047" = "koodi hylkäsi palvelimensa";

/* errSecCSNotAHost */
"-67046" = "koodi ei ole palvelin";

/* errSecCSSignatureInvalid */
"-67045" = "allekirjoituksen muoto on virheellinen";

/* errSecCSHostProtocolRelativePath */
"-67044" = "palvelinprotokollavirhe - asiakkaan absoluuttinen polku vaaditaan";

/* errSecCSHostProtocolContradiction */
"-67043" = "palvelinprotokollavirhe - ristiriitaiset palvelintilat";

/* errSecCSHostProtocolDedicationError */
"-67042" = "palvelinprotokollavirhe - toimintoa ei sallita erillisasiakkaalle";

/* errSecCSHostProtocolNotProxy */
"-67041" = "palvelinprotokollavirhe - välipalvelin ei ole käytössä";

/* errSecCSHostProtocolStateError */
"-67040" = "palvelinprotokollavirhe - virheellinen asiakastilan vaihtopyyntö";

/* errSecCSHostProtocolUnrelated */
"-67039" = "palvelinprotokollavirhe - määritelty asiakas ei ole määritellyn palvelimen asiakas";

/* errSecCSInvalidOperation */
"-67038" = "pyydetty toiminto on virheellinen";

/* errSecCSNotSupported */
"-67037" = "toimintoa ei tueta tämän tyyppiselle koodille";

/* errSecCSCMSTooLarge */
"-67036" = "allekirjoitus liian pitkä sisällytettäväksi";

/* errSecCSHostProtocolInvalidHash */
"-67035" = "palvelinprotokollavirhe - virheellinen asiakashajautus";

/* errSecCSStaticCodeChanged */
"-67034" = "levyn ohjelma ei täsmää käynnissä olevan kanssa";

/* errSecCSSigDBDenied */
"-67033" = "pääsy allekirjoitustietokantaan estetty";

/* errSecCSSigDBAccess */
"-67032" = "ei pääsyä allekirjoitustietokantaan";

/* errSecCSHostProtocolInvalidAttribute */
"-67031" = "virheellinen palvelin tai yhteensopimaton vierasattribuutti";

/* errSecMisc_dskFulErr */
"-34" = "Levy on täynnä.";

/* errSecMisc_nsvErr */
"-35" = "Levyä ei löytynyt. Se on saatettu poistaa asemasta.";

/* errSecMisc_bdNamErr */
"-37" = "Yritettiin avata tiedosto, jonka nimi sisältää luvattoman merkin.";

/* errSecMisc_fnfErr */
"-43" = "Tiedostoa ei löytynyt.";

/* errSecMisc_wPrErr */
"-44" = "Levy on kirjoitussuojattu.";

/* errSecMisc_fLckdErr */
"-45" = "Tiedosto on lukittu.";

/* errSecMisc_vLckdErr */
"-46" = "Taltio on lukittu.";

/* errSecMisc_fBsyErr */
"-47" = "Tiedosto on varattu. Se saattaa olla toisen ohjelman käytössä.";

/* errSecMisc_dupFNErr */
"-48" = "Samanniminen tiedosto on jo olemassa.";

/* errSecMisc_opWrErr */
"-49" = "Tiedosto on jo avattu kirjoitusoikeuksin.";

/* errSecMisc_volOffLinErr */
"-53" = "Taltio ei ole enää käytettävissä. Se on saatettu poistaa asemasta.";

/* errSecMisc_permErr */
"-54" = "Tiedostoa ei voitu avata. Se saattaa olla toisen ohjelman käytössä.";

/* errSecMisc_extFSErr */
"-58" = "Taltio ei ehkä ole yhteensopiva.";

/* errSecMisc_wrPermErr */
"-61" = "Tiedostoon ei voida kirjoittaa. Se on saatettu avata riittämättömin käyttöoikeuksin.";

/* errSecMisc_offLinErr */
"-65" = "Tallennuslaite ei ole enää käytettävissä. Se on saatettu poistaa asemasta.";

/* errSecMisc_dirNFErr */
"-120" = "Hakemistoa ei löytynyt.";

/* errSecMisc_volGoneErr */
"-124" = "Palvelintaltio ei ole enää käytettävissä. Yhteys on ehkä katkaistu.";

/* errSecMisc_userCanceledErr */
"-128" = "Käyttäjä kumosi toiminnon.";

/* errSecMisc_resNotFound */
"-192" = "Tarvittavaa resurssia ei löytynyt.";

/* errSecMisc_resFNotFound */
"-193" = "Tarvittava resurssi puuttuu tai on viallinen.";

/* errSecMisc_icNoURLErr */
"-673" = "Määritelty sijainti on tuntematonta tyyppiä tai ei sisällä tarpeeksi tietoa.";

/* errSecMisc_icConfigNotFoundErr */
"-674" = "Määritellyn osoitteen avaamiseen tarvittavaa apuohjelmaa ei löytynyt.";

/* errSecMisc_cantGetFlavorErr */
"-1854" = "Kohteen sijainti puuttuu tai on väärin muotoiltu.";

/* errSecMisc_afpAccessDenied */
"-5000" = "Pääsy kohteeseen evättiin.";

/* errSecMisc_afpUserNotAuth */
"-5023" = "Todentaminen epäonnistui. Palvelimen salasana on saattanut muuttua sen jälkeen, kun kohde lisättiin avainnippuun.";

